{
    "about-section-title" : "Fargekontrastsjekker og -designer for WCAG 2.1 (CCC 2.1)",
    "about-summary" : "Dette er et verktøy for å øke tilgjengelighet og lesbarhet av visuell informasjon på nettsider og i IKT-applikasjoner. Verktøyet hjelper deg med å velge paletter (fargekombinasjoner) med gode kontraster mellom fargene. Gode kontraster følger retningslinjene for tilgjengelig webinnhold (WCAG).", 
    "about-description" : "Verktøyet beregner fargekontraster, finner matchende WCAG-nivå, gir forslag for gode kontraster og tilbyr også et område som lar deg teste ut paletten i praksis med eksempler som ofte brukes i digital brukergrensesnitt.", 
    "shortcuts-title": "Snarveier",
    "shortcuts": "Her finner du snarveier til de viktigste funksjonene på nettsiden, samt forklaringer om hva de gjør:",
    "about-contributors-title" : "Bidragsytere og støtte", 
    "about-contributors" : "Disse har bidratt til utviklingen av verktøyet", 
    "contributor-1": "drjoschua",
    "contributor-link-1": "https://github.com/drjoschua",
    "contributor-2": "thorkr",
    "contributor-link-2": "https://github.com/thorkr",
    "contributor-3": "untill",
    "contributor-link-3": "https://github.com/untill",
    "contributor-4": "kamillamortensen",
    "contributor-link-4": "https://github.com/kamillamortensen", 
    "about-code-1" : "Koden til verktøyet ligger på ", 
    "about-code-link" : "Github", 
    "about-code-2" : " med en åpen kildekode-lisens og kan dermed lastes ned og brukes fritt.", 
    "about-funding-1" : "Verktøyet ble utviklet av forskningsstiftelsen ", 
    "about-funding-link-1" : "Norsk Regnesentral", 
    "about-funding-2" : " med tilskuddsmidler fra ", 
    "about-funding-link-2": "Barne-, ungdoms- og familiedepartementet (Bufdir) i Norge",
    "about-funding-3": ".",
    "about-feedback-title" : "Tilbakemeldinger", 
    "about-feedback-1" : "Vi setter pris på din tilbakemelding, spesielt ros, men også hvis det er ting du er mindre fornøyd med eller om du har forbedringsforslag. Da kan du rapportere saken som en «new issue» på ",
    "about-feedback-link" : "Github", 
    "about-feedback-2" : ".", 
    "about-wcag" : "Retningslinjene for tilgjengelig webinnhold, kjent som Web Content Accessibility Guidelines (WCAG) på engelsk, er tekniske retningslinjer som fokuserer på tilgjengelighet av nettsider. Disse retningslinjene er nyttige for utviklere som ønsker å skape nettsider som er tilgjengelige og brukervennlige for alle brukere, uavhengig av funksjonsnedsettelse.",
    "about-wcag-versions-1": "Det finnes flere versjoner av WCAG, inkludert",
    "wcag-20": "WCAG versjon 2.0",
    "wcag-20-link": "https://www.w3.org/Translations/WCAG20-no/",
    "wcag-21": "WCAG versjon 2.1",
    "wcag-21-link": "https://www.w3.org/Translations/WCAG21-no/",
    "wcag-22": "WCAG versjon 2.2",
    "wcag-22-link": "https://www.w3.org/TR/WCAG22/",
    "about-wcag-legal-1": "Fra 1. februar 2023 ble WCAG 2.1 en del av norsk rett gjennom ",
    "wcag-legal-1": "EUs webdirektivet (WAD)",
    "wcag-legal-link-1": "https://www.uutilsynet.no/webdirektivet-wad/eus-webdirektiv-wad/",
    "about-wcag-legal-2": " og gjelder for alle nettsider i både offentlig og privat sektor",
    "about-button-linking-to-wcag" : "Les om farger i WCAG 2.1",
    "about-button-linking-to-wcag-ext" : " (åpnes i nytt vindu), spesielt 1.4.3, 1.4.6 og 1.4.11.",
    "about-contrasts-title": "Tilgjengelige og lesbare fargekontraster",
    "about-contrasts" : "WCAG specifiserer blant annet hva som er gode fargekontraster. Kontrasten mellom to farger kan beskrives som et desimaltall mellom 1 og 21. Kontrasttallet mellom to farger vil være likt uavhengig av hvilken farge som er i foregrunn eller bakgrunn.",
    "about-wcag-list-heading" : "Fire kategorier for fargekontraster definert av WCAG:",
    "about-wcag-aaa" : "Er oppnådd om kontrasttallet for farge av tekst på vanlig størrelse og bakgrunnsfarge er større enn 7. For stor tekst må kontrasttallet være minst 4,5.",
    "about-wcag-aa" : "Er oppnådd for vanlig tekststørrelse om kontrasttallet er større enn 4,5. For stor tekst må kontrasttallet være minst 3.",
    "about-wcag-nontext-aa" : "Stor tekst og grafiske elementer som ikke er tekst må ha kontrasttall større enn 3.",
    "about-wcag-low" : "Kontrasttall under 3 er for dårlige, også til stor tekst og elementer som ikke er tekst. Må unngåes.",
    "contrast-section-title" : "Kontraster for din palett",
    "get-started-section-title" : "Kom igang",
    "get-started-description" : "I seksjonen «Din palett» kan du legge til og fjerne farger. Du endrer en farge ved å klikke på fargen eller ved å skrive inn hex-koden direkte. Under finner du et lite utvalg forhåndsdefinerte eksempelpaletter du kan bruke som utgangspunkt. Ellers vil du finne ulik funksjonalitet under hver fane, så her bør du utforske hvilke funksjoner som er mest nyttige for deg.",
    "default-palettes-description" : "Paletteksemplene ble inspirert av ",
    "test-section-title" : "Kontrast eksempler",
    "test-section-explanation" : "Test fargene i praksis. Her kan du se hvordan fargekombinasjonene kan se ut i praksis.",
    "contrast-table-title"  : "Visning av valgte fargekombinasjoner med kontrasttall i en matrise", 
  "contrast-table-radiobutton-title" :  "Velg visning for tabellen",
  "contrast-table-example" :  "Abc 123",
  "contrast-table-empty" :  "Tabellen er tom. Klikk på plusstegnet (+) under «Din palett» for å legge til en farge. Du trenger minst 2 farger for at kontraster kan vises.",
    "recommendation-section-title" : "Anbefalinger for fargekombinasjoner",
    "recommendation-explanation" : "Basert på din palett anbefales fargekombinasjonene under, delt inn i henhold til passende WCAG-nivå.",
    "wcag-section-title" : "Retningslinjer for tilgjengelig webinnhold (WCAG)",
  "my-colors-heading" : "Din palett",
  "my-colors-description" : "Her kan du velge farger for å lage en fargepalette.",
  "my-colors-empty" : "Paletten er tom. Klikk på plusstegnet (+) for å legge til en farge.",
    "change-color" : "Endre farge",
    "input-delete" : "fjern farge",
    "add-color" : "legg til fargekode",
    "clear-palette" : "tøm paletten",
    "contrast-description" : "I tabellen under kan du se kontrasttall og WCAG-nivå for alle fargekombinasjoner i paletten din. Du kan velge om du vil se WCAG-nivåer for tekst eller ikke-tekst.",
    "contrast-summary-heading": "kombinasjoner",
    "contrast-summary-aaa": "Utmerket kontrast for tekst (nivå AAA)",
    "contrast-summary-aa" : "God / grei kontrast for tekst (nivå AA)",
    "contrast-summary-nontext-aa" : "Grei kontrast for ikke-tekst (nivå AA)",
    "contrast-summary-low" : "Dårlig kontrast",
    "table-switch" : "Bytt visning: ",
    "view-wcag-level" : "Vis WCAG-nivå for",
    "view-wcag-level-text" : "tekst",
    "view-wcag-level-non-text" : "ikke-tekst",
    "mockup-title" : "Slik ser fargene ut",
    "mockup-text-small" : "Se hvordan fargevalgene dine påvirker lesbarhet og design! ",
    "mockup-form-title" : "Avkrysningsspørsmål",
    "mockup-form-statement1" : "Jeg er kul",
    "mockup-form-statement2" : "Jeg er snill",
    "mockup-footer-text" : "Jeg er en footer",
    "mockup-textbox-header" : "Test fargene i en tekstboks!",
    "mockup-textbox-maintext" : "Du kan endre farger til venstre for å se andre mulige kombinasjonser fra palettet.",
    "change-color-menu-direction": "Endre plassering av fargemeny",
  "try-palette-or-try-yourself" : "...eller legg til fargekoder fra menyen til venstre!",
  "tab-colblind-title-long" : "Simulering av fargeblindhet",
  "tab-colblind-title-description-1" : "Fargeblindhet er en variasjon i fargesynet som karakteriseres ved at man ikke kan se forskjell mellom to eller flere farger eller at man ikke kan gjenkjenne farger i omgivelsen. Omtrent 1 i 10 menn har en eller annen form av nedsatt fargesyn, samtidig at det er mindre enn 1% av kvinnene som opplever fargeblindhet. Å være fargeblind betyr ikke at man ser verden i svart og hvit. De aller fleste med nedsatt fargesyn nyter farger, men omfanget av de opplevde fargene er noe redusert sammenliknet med en «normalt» seende.",
  "tab-colblind-title-description-2" : "Ved å trykke på knappene nedenfor, kan du velge en av de mest vanlige fargeblindhetene for å se hvordan noen med nedsatt fargesyn opplever farger sammenliknet med en \"normalt\" seende. Her kan du simulere ulike typer fargeblindhet ved hjelp av Brettel-algoritmen [1].",
  "ok" : "ok",
  "cancel" : "avbryt",
  "about-tab-title" : "Om CCC 2.1",
  "get-started-tab-title" : "Kom igang",
  "get-started-tab-description" : "Her får du mer informasjon om paletten og et utvalg av paletteeksempler.",
  "contrast-tab-title" : "Kontraster",
  "contrast-tab-description" : "Her får du kontrastverdiene mellom alle fargekombinasjoner i din fargepalette.",
  "testing-tab-title" : "Eksempler",
  "testing-tab-description" : "Her ser du eksempler hvordan dine valgte farger påvirker typiske funksjonselementer i et digitalt brukergrensesnitt.",
  "recommendation-tab-title" : "Anbefalinger",
  "recommendation-tab-description" : "Her får du anbefalinger om hvilke fargekombinasjoner er egnet eller ikke egnet for din nettside.",
  "wcag-tab-title" : "Om WCAG",
  "wcag-tab-description" : "Her kan du lære mer om WCAG og fargekontraster.",
  "coldef-tab-title" : "Fargeblindhet",
  "coldef-tab-description" : "Her kan du velge ulike fargeblindhetssimuleringer for dine valgte farger.",
  "default-palettes-legend": "Paletteksempler",
  "no-elements": "Ingen anbefalinger fordi du ikke har valgt noen farger ennå.",
  "recommendation-no-colors" : "Du har ikke valgt noen farger enda. Klikk på plusstegnet (+) under «Din palett» for å legge til en farge. Du trenger minst 2 farger for at anbefalinger kan beregnes.",
  "test-area-empty": "Ingen eksempler ennå. Klikk på plusstegnet (+) under «Din palett» for å legge til en farge. Du trenger minst 2 farger for å teste."
}
